Revit 2024 API
ReferenceableViewUtils Class
 Utilities related to reference views such as reference sections and reference callouts.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public static class ReferenceableViewUtils
Visual Basic
Public NotInheritable Class ReferenceableViewUtils
Visual C++
public ref class ReferenceableViewUtils abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ReferenceableViewUtils
See Also
ReferenceableViewUtils Members
Autodesk.Revit.DB Namespace